package 变量和数据类型;

public class Variate_DataType {
	public static void main(String[] args) {
//		在Java中，变量分为两种：基本类型的变量和引用类型的变量。
		
//		基本数据类型是CPU可以直接进行运算的类型。Java定义了以下几种基本数据类型：8?4211
//		整数类型：byte(1)，short2，int4，long(8字节)
//		浮点数类型：float4，double(8)
//		字符类型：char2
//		布尔类型：boolean
//		对于整型类型，Java只定义了带符号的整型，因此，最高位的bit表示符号位（0表示正数，1表示负数）。各种整型能表示的最大范围如下：
//		byte：-128 ~ 127
//		short: -32768 ~ 32767
//		int: -2147483648 ~ 2147483647
//		long: -9223372036854775808 ~ 9223372036854775807
//		对于float类型，需要加上f后缀。
//		ps :Java语言对布尔类型的存储并没有做规定，因为理论上存储布尔类型只需要1 bit，但是通常JVM内部会把boolean表示为4字节整数。
//     char类型使用单引号'，且仅有一个字符，要和双引号"的字符串类型区分开。
		
//		定义变量的时候，如果加上final修饰符，这个变量就变成了常量：
//		这个时候，如果想省略变量类型，可以使用var关键字：
		
//		变量的作用范围

//		小结
//		Java提供了两种变量类型：基本类型和引用类型
//
//		基本类型包括整型，浮点型，布尔型，字符型。
//
//		变量可重新赋值，等号是赋值语句，不是数学意义的等号。
//
//		常量在初始化后不可重新赋值，使用常量便于理解程序意图。
	}
}
